{
  "pageTitle": {
    "ipfs": "Споделяне на IPFS",
    "add": "Сподели Файлове",
    "download": "Свалени Файлове"
  },
  "header": "Сподели",
  "footer": "",
  "powered-by-helia": "Подсилено от <1>Hella</1>",
  "info": {
    "add": {
      "title": "Сподели файлове използвайки IPFS",
      "subtitle": "Сподели директно от твоето устройство - не е нужно облак.",
      "labelAdd": "Добави твоите файлове",
      "copyAdd": "Добавете файлове, за да ги споделите директно от вашето устройство през IPFS мрежата. Всеки с уникалния код във вашата връзка за споделяне може да изтегли вашите файлове, така че не добавяйте чувствителни или защитени с авторски права материали.",
      "labelKeepPage": "Дръжте тази страница отворена!",
      "labelKeepDaemon": "Дръжте вашият IPFS възел работещ!",
      "copyKeepPage": "Тъй като споделяте директно от вашето устройство, важно е тази страница да остане отворена, докато получателят изтегли файловете. Ако споделяте с група, другите в групата могат да ви помогнат да хоствате съвместно файловете, като държат страницата за споделяне отворена в своите браузъри.",
      "copyKeepDaemon": "Тъй като споделяте директно от вашето устройство, важно е вашият IPFS възел да работи, докато получателят изтегли файловете. Ако споделяте с група, всеки в групата може да помогне за съвместното хостване на файловете, като държи страницата за споделяне отворена в браузъра си или ако изпълнява IPFS възел, закача идентификатора на съдържанието (CID) от вашата връзка към техния възел.",
      "labelSend": "Споделете връзката",
      "copySend": "Всяка връзка за споделяне съдържа уникален пръстов отпечатък, наречен CID, който позволява на устройството на получателя да намери това съдържание в IPFS мрежата."
    },
    "download": {
      "title": "Имате файлове!",
      "subtitle": "Изтеглете директно от подателя — не е необходим облак.",
      "labelHow": "Как работи IPFS Share?",
      "copyHow": "IPFS Share използва глобалната IPFS мрежа, за да позволи на хората да споделят файлове директно помежду си — не е необходим облак или сървър на трета страна. И тъй като файловете в IPFS се идентифицират по това какво съдържат, а не по това къде се намират, можете да сте сигурни, че това, което изтегляте, е същото съдържание, което подателят е предвидил.",
      "labelKeep": "Искате ли да споделите тези файлове с някой друг?",
      "copyKeepPage": "Можете да сте част от IPFS мрежата и да споделяте тези файлове директно от вашето устройство, просто като държите тази страница отворена. Просто споделете връзката, която сте получили, и не затваряйте тази страница, докато получателят не изтегли файловете.",
      "copyKeepDaemon": "Можете да споделяте тези файлове директно от вашето устройство, просто като поддържате вашия IPFS възел работещ. Просто споделете връзката, която сте получили, и не забравяйте да поддържате своя възел работещ, докато получателят изтегли файловете."    },
    "learnMore": "Научете повече."
  },
  "helia-error": {
    "title": "Възникна грешка при опит за инициализиране на Helia възел.",
    "message": "Грешка:{message}",
    "more-details": "Проследяването на стека за грешки е достъпно в конзолата на браузъра.",
    "refresh-page": "Може да се наложи да <1>опресните страницата</1>, за да опитате да създадете отново своя Helia възел.",
    "open-issue": ""
  },
  "modal": {
    "how": {
      "title": "Как работи IPFS Share",
      "ariaLabel": "Модално обяснение как работи IPFS Share",
      "copy": "IPFS Share е прост, безплатен начин за споделяне на файлове, без да е необходимо да разчитате на услуги, управлявани от големи корпорации. Вместо това той използва IPFS протокола peer-to-peer за директно споделяне между устройства. IPFS е изграден около адресиране на съдържанието — следене на файлове въз основа на това, което съдържат, а не къде се намират — което означава, че файловете не могат да бъдат модифицирани, без да се променят и техните адреси. С други думи, когато изтегляте файл с помощта на IPFS, можете да сте сигурни, че той е точно същият, какъвто е предвидил подателят.",
      "learnMore": "Научете как IPFS променя интернет, като посетите <1>уебсайта на IPFS</1>. Любопитни ли сте как работи адресирането на съдържание? Посетете <3>ProtoSchool</3> за уроци и други ресурси."
    },
      "reprovide": {
      "title": "Повторно споделяне на файлове, които сте получили",
      "ariaLabel": "Модално обяснение как да споделяте тези файлове с някой друг",
      "copy": "Лесно е да споделите тези файлове с някой друг, като направите вашето устройство част от IPFS мрежата. Всичко, което трябва да направите, е да държите тази страница отворена; по този начин вашето устройство става възел в мрежата и прави тези файлове достъпни директно за другите. След това споделете връзката, която сте получили – и не забравяйте да оставите тази страница отворена, докато не разберете, че вашият получател е изтеглил файловете.",
      "learnMore": "Любопитно как работи това под капака? Разгледайте <1>официалната IPFS документация</1> за всичко от основни обяснители до инструменти за разработчици."
    },
    "privacy": {
      "title": "Споделяне на файлове в IPFS",
      "ariaLabel": "Модално описание на споделянето и поверителността на IPFS",
      "copy": "Този сайт използва IPFS, протокол peer-to-peer за съхраняване и споделяне на данни директно между потребители, без да разчита на съхранение в облак или други услуги, управлявани от големи корпорации. Тъй като IPFS е публична мрежа, когато споделяте съдържание с помощта на IPFS споделяне, вие позволявате на всеки, който знае уникалния CID във вашата връзка за споделяне, да го извлече. Това означава, че трябва да избягвате споделянето на чувствителни файлове или защитени с авторски права материали.",
      "learnMore": "Искате ли да научите повече за IPFS? Посетете <1>уебсайта</1> за основите или се задълбочете в подробностите за IPFS и поверителността в <3>официалната документация</3>."
    },
    "cid": {
      "title": "Какво е CID?",
      "ariaLabel": "Модално обяснение на идентификатори на съдържание",
      "copy": "Идентификаторите на съдържанието (CID) са криптографски генерирани отпечатъци, които позволяват на IPFS да намира и доставя файлове. Тъй като IPFS идентифицира файловете според това какво съдържат, а не къде се намират, CID сочи не само към конкретен файл, но и към конкретна версия - ако файлът е модифициран, CID също се променя. Когато споделяте файл с помощта на IPFS Share, можете да видите неговия CID, като потърсите във връзката за споделяне дългия низ от знаци, започващ с \"bafy\".",
      "learnMore": "Искате ли да се задълбочите в това как работят идентификаторите на съдържание? Посетете <1>ProtoSchool</1> за уроци и други ресурси за децентрализираната уеб технология, която прави IPFS активен."
    }
  },
  "addFiles": "Добавете файлове",
  "addFolder": "Или добавете папка",
  "copyLink": {
    "labelIndividual": "Споделяйте отделни файлове",
    "labelAll": "Споделете всички файлове",
    "footNote": "Тази връзка се променя, ако добавите още файлове, така че не забравяйте да споделите най-новата версия.",
    "publishing": "Публикуване...",
    "copy": "Сподели",
    "copied": "Копирано!",
    "qrLabel": "Или сканирайте, за да споделите всички файлове"
  },
  "loader": {
    "fileList": "Списъкът с файлове се зарежда..."
  },
  "downloadFiles": {
    "download": "Изтегляне",
    "downloadAll": "Изтеглете всички",
    "downloading": "Изтегляне..."
  },
  "dropdown": {
    "clickLabel": "Щракнете тук, за да отворите падащото меню"
  }
}
